In [3]:
import pandas as pd
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [2]:
df = pd.read_table('examples/ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_csv('examples/ex2.csv', header=None)   # 不会输出头 header

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('examples/ex2.csv', names=['z','d','y','h', '自定义header'])

   z   d   y   h 自定义header
0  1   2   3   4     hello
1  5   6   7   8     world
2  9  10  11  12       foo

In [10]:
namelist=['z','d','y','h', 'message']
pd.read_csv('examples/ex2.csv', names=namelist, index_col='message')   # 以message这一列作为索引   索引自定义

         z   d   y   h
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [13]:
parse = pd.read_csv('examples/csv_mindex.csv', index_col=['key1','key2'])    
parse      # 俩个列作为索引   优先前一个  貌似没啥用

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [1]:
list(open('examples/ex3_2.txt'))   # 怎么选取分隔符  这里需要关闭文件  否则后面不能读取

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [4]:
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [5]:
!cat examples/ex5.csv   # 缺失值

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [1]:
import pandas as pd
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [10]:
# pd.isnull(result)
result = pd.read_csv('examples/ex5.csv', na_values=['NULL', '4'])   # 如果值是NULL 或者 4  就为 NaN
result

  something  a   b     c     d message
0       one  1   2   3.0   NaN     NaN
1       two  5   6   NaN   8.0   world
2     three  9  10  11.0  12.0     foo

In [11]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}  # 如果在message列有foo和NA 就设置为NaN
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [13]:
pd.options.display.max_rows = 10
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [16]:
result = pd.read_csv('examples/ex6.csv', nrows=5)   # 读取前5行 
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [20]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [21]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
data.to_csv('examples/输出测试1.csv')

In [23]:
!cat examples/输出测试1.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [24]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [25]:
data.to_csv(sys.stdout, na_rep='NULL')   # 输出的时候把缺失值表示为空字符串

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [26]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])   # 挑选出对应的列

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [27]:
import numpy as np
datas = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=datas)
ts.to_csv('examples/输出测试2.csv')

In [28]:
!cat examples/输出测试2.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [29]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [31]:
import csv
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [32]:
header , values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [39]:
import json
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [43]:
asjson = json.dumps(result)  # 将python对象转换成JSON格式
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [44]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings    # 通过表属性选择   和 属性  来决定选取的子集

    name  age
0  Scott   30
1  Katie   38

In [46]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
print(len(tables))
failures = tables[0]
failures.head()   # 取前5个

1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [47]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()   # 按年份计算倒闭的银行数

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [50]:
frame = pd.read_csv('examples/ex1.csv')
frame.to_pickle('examples/frame_pickle')   # 以pickle格式保存到磁盘上去 二进制格式
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [51]:
pd.read_pickle('examples/frame_pickle')  # pickle仅建议用于短期存储格式    很难保证该格式永远是稳定的

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [54]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')    #  先弄个文件读进内存  再用pandas读

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [55]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')  # 这也可以的
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [56]:
frame.to_excel('examples/ex2.xlsx')

In [59]:
# 与网络交互
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
data = resp.json()
data[0]['title']

'Split test multi'

In [60]:
# 提取有兴趣的字段
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,20669,Split test multi,[],open
1,20668,DOC: Document EA methods that use astype(object),"[{'id': 134699, 'url': 'https://api.github.com...",open
2,20667,DOC: Updated the docstring of pandas.Series.st...,[],open
3,20666,Installation of Pandas in Pip v10.0.0b2 on PyP...,"[{'id': 129350, 'url': 'https://api.github.com...",open
4,20665,API: groupby-apply with on a DataFrame returni...,"[{'id': 35818298, 'url': 'https://api.github.c...",open
...,...,...,...,...
25,20637,Save the name of undefined variables in expres...,"[{'id': 57296398, 'url': 'https://api.github.c...",open
26,20636,BUG: indexing in datetime IntervalIndex with d...,"[{'id': 76811, 'url': 'https://api.github.com/...",open
27,20635,BUG: indexing with loc and iloc with list-like...,"[{'id': 76811, 'url': 'https://api.github.com/...",open
28,20634,update the pandas.Series.str.repeat docstring,"[{'id': 134699, 'url': 'https://api.github.com...",open
29,20633,API: offsets.Day should be one calendar day in...,"[{'id': 35818298, 'url': 'https://api.github.c...",open

In [61]:
# 与数据库的交互  暂时不弄了